# Нехай ми маємо текстовий файл, який містить дані з місячною заробітною платою по кожному розробнику компанії.
#Як бачимо, структура файлу – це прізвище розробника та значення його заробітної плати, розділеної комою.
#Розробіть функцію total_salary(path) (параметр path - шлях до файлу), яка буде розбирати текстовий файл і повертати загальну суму заробітної плати всіх розробників компанії.
#Вимоги до завдання:

#1. функція total_salary повертає значення типу float
#2. для читання файлу функція total_salary використовує лише метод readline
#3. ми поки що не використовуємо менеджер контексту with

import re
def total_salary(path):
    file = open(path, 'r')
    result = 0
    while True:
        line = file.readline()
        list = re.findall(r"\d+", line)
        for i in list:
            result += float(i)
        if not line:
            break
    file.close()
    return result


